class StringConstant {
  static String appName = "BMI Calculator";
  static String weightLabel = "น้ำหนักตัว (kg.)";
  static String heightLabel = "ส่วนสูง (cm.)";
  static String calculatorButton = "คำนวณ";
  static String bmiLabel = "BMI";
  static String weightSuggetion = "น้ำหนักที่เหมาะสม";
  static String skinnyHeader = "น้ำหนักน้อยกว่ามาตรฐาน";
  static String normalHeader = "น้ำหนักปกติ";
  static String fatHeader1 = "ท้วม / อ้วนระดับ 1";
  static String fatHeader2 = "อ้วน / อ้วนระดับ 2";
  static String fatHeader3 = "อ้วนมาก / อ้วนระดับ 3";
  static String skinnyBody =
      """คุณมีน้ำหนักน้อยหรือผอม โดยทั่วไป ค่าดัชนีมวลกายปกติมีค่าน้อยกว่า 18.50

      ข้อแนะนำ

      1. ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสมและปริมาณมากขึ้น โดยเพิ่มอาหารประเภทที่ให้พลังงานมากขึ้น เช่น ไขมัน แป้ง ข้าว เนื้อสัตว์ นม

      2. ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวันหรือเกือบทุกวัน ให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น เช่น เดินเร็ว ถีบจักรยาน รำมวยจีน ลีลาศจังหวะช้า รวมทั้งงานบ้าน งานสวน เป็นต้น สะสมให้ได้อย่างน้อยวันละ 30 นาทีอาจไม่จำเป็นต้องออกกำลังกายให้เหนื่อยมากหรือหอบ ที่ง่ายที่สุดคือ การเดิน
      """;
  static String normalBody =
      """คุณมี น้ำหนักปกติ โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 18.50 - 22.90

      ข้อแนะนำ

      1. ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสม กินเท่าที่ร่างกายต้องการวันไหนกินมากเกินไป วันต่อมาก็กินลดลง กินอาหารพวกข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ให้มากขึ้นไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อไม่ให้มีพลังงานส่วนเกินจะทำให้ควบคุมน้ำหนักได้ดีและสมดุล

      2. ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวัน อย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมให้ได้อย่างน้อยวันละ 30 นาที โดยอาจจะแบ่งเป็น 2 - 3 ครั้งก็ได้ จะเป็นกิจกรรมออกกำลังกายที่เป็นเรื่องเป็นราวหรือการออกแรงในกิจวัตรประจำวัน เช่นเดินเร็ว ถีบจักรยาน ลีลาศ หรืองานบ้าน งานสวน ให้เลือกทำตามใจชอบ ถ้าคุณต้องการมีสมรรถภาพที่ดีก็ต้องออกกำลังกายแบบแอโรบิก เช่น เดินเร็ว ๆ วิ่งเหยาะ ถีบจักรยานเร็วๆ กระโดดเชือก ว่ายน้ำ เล่นกีฬา เป็นต้น ให้รู้สึกเหนื่อยมาก หรือหอบ อย่างน้อยวันละ 20 - 30 นาที อย่างน้อยสัปดาห์ละ 3 วัน ที่ง่าย ที่สุดคือ การเดิน
  """;
  static String fatBody1 =
      """คุณมี น้ำหนักเกิน หรือรูปร่างท้วม โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 23 - 24.90

      ข้อแนะนำ

      1. ควรควบคุมอาหาร โดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/ เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้ง รวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน

      2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมอย่างน้อยวันละ 30 นาที อาจแบ่งเป็นวันละ 2 - 3 ครั้งก็ได้ เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรกควร ออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อย ๆ ก่อน จากนั้นค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการ และเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี

      3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง
      """;
  static String fatBody2 =
      """คุณ อ้วนแล้ว (อ้วนระดับ 2) โดยทั่วไปค่าดัชนีมวลกายปกติมีค่าระหว่าง 25 - 29.90

      ข้อแนะนำ

      1. ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน

      2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20 - 30 นาที เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี

      3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง

      4. ถ้าคุณสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วคุณมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี คุณจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม

      5. ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก
      """;
  static String fatBody3 =
      """คุณ อ้วนมากแล้ว (อ้วนระดับ 3) โดยทั่วไปค่าดัชนีมวลกายปกติมีค่ามากกว่า 30

      ข้อแนะนำ

      1. ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน

      2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20 - 30 นาที เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี

      3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง

      4. ถ้าคุณสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วคุณมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี คุณจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม

      5. ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก
      """;

  static String noticeHeader1 = "ค่าดัชนีมวลกาย (BMI)";
  static String noticeHeader2 = "สูตรคำนวณค่า BMI";
  static String noticeHeader3 = "เปรียบเทียบค่า BMI";
  static String noticeHeader4 = "ข้อจำกัดของค่า BMI";
  static String noticeHeader5 = "ความเสื่ยงเมื่อมีค่า BMI สูงเกินไป";
  static String noticeHeader6 = "วิธีควบคุมค่า BMI ให้อยู่ในเกณฑ์เหมาะสม";

  static String noticeBody1 = """ค่าดัชนีมวลกาย (BMI : Body Mass Index) เป็นข้อมูลดัชนีทางคณิตศาตร์ ที่ใช้การวัดจากน้ำหนัก (Weight) และส่วนสูง (Height) มาคำนวณค่า BMIเพื่อหาค่าผลลัพธ์ของปริมาณไขมันทั้งหมด เมื่อหาคำนวณมวลร่างกายเรียบร้อย ทางแพทย์จะนำคำตอบนี้ในการประเมินสภาวะลักษณะร่างกายของผู้ใช้บริการในปัจจุบัน ว่าเกณฑ์น้ำหนักของคุณถูกประเมินอยู่ในระยะร่างกายรูปแบบไหน""";
  static String noticeBody2 = """วิธีคำนวณ BMI ในการหาค่าดัชนีมวลกาย = น้ำหนักตัว [กิโลกรัม] ÷ ส่วนสูง [เมตร] ยกกำลังสอง
 
ยกตัวอย่างเช่น ผู้หญิง น้ำหนัก 50 กิโลกรัม ส่วนสูง 160 เซนติเมตร 
 
ดัชนีมวลกาย (BMI) = 50 ÷ (1.60 * 1.60)
ดัชนีมวลกาย (BMI) = 50 ÷ 2.56 
ดัชนีมวลกาย (BMI) = 19.5 
 
เมื่อได้คำตอบค่าคำนวณดัชนีมวลกายแล้ว ให้นำตัวเลขนี้ไปเปรียบเทียบตารางเกณฑ์ BMI ตามเพศสภาพของตัวเอง""";
  static String noticeBody3 = """ระดับ < 18.5 สภาวะ “น้ำหนักต่ำกว่าเกณฑ์”

บุคคลที่มีค่า BMI ในเกณฑ์ระดับน้ำหนักต่ำกว่ามาตรฐาน มีภาวะความเสี่ยงสูงที่ร่างกายขาดสารอาหารในการหล่อเลี้ยงภายในร่างกายได้ไม่เพียงพอ ส่งผลกระทบให้ร่างกายอ่อนเพลียง่าย ภูมิคุ้มกันพกบร่อง การออกกำลังกายควบคู่กับการรับประทานอาหารที่มีส่วนประกอบโปรตีนสูง จะช่วยทำให้กล้ามเนื้อแข็งแรงและมีสารอาหารมากพอไปซ่อมแซมการทำงานของอวัยวะภายในได้อย่างเพียงพอ
 
ระดับ 18.5 - 22.9 สภาวะ “น้ำหนักสมส่วน”

บุคคลที่ค่า BMI อยู่ในเกณฑ์ระดับน้ำหนักตามมาตรฐาน เป็นกลุ่มบุคคลที่มีภาวะเสี่ยงต่อโรคแทรกซ้อนจากโรคอ้วนได้น้อยที่สุด ควรรักษาความสุมดลของค่า BMI ระดับนี้ไว้อย่างสม่ำเสมอ และหมั่นตรวจเช็คการคำนวณค่า BMI จากการตรวจสุขภาพประจำปี เพื่อเป็นผลชี้วัดในการตรวจเช็คมวลร่างกายอยู่เสมอ
 
ระดับ 23.0 - 24.9 สภาวะ “น้ำหนักเกินมาตรฐาน”
 
บุคคลที่มีค่า BMI อยู่ในเกณฑ์ระดับเกินตามมาตรฐาน มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้ ควรควบคุมปริมาณไขมันในร่างกายตัวเอง ด้วยการเลือกทานอาหารที่มีโปรตีนสูง หมั่นออกกำลังกาย และพักผ่อนให้เพียงพอตลอดกิจวัตรประจำวัน เพื่อลดระดับไขมันให้กลับมาอยู่ในเกณฑ์มาตรฐาน
 
ระดับ 25.0 - 29.9 สภาวะ “อ้วน”
 
บุคคลที่คํานวณค่า BMI แล้วอยู่ในเกณฑ์ระดับเกินตามมาตรฐานมาก มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้สูง ควรควบคุมปริมาณไขมันในร่างกายตัวเองแบบเร่งด่วน ด้วยการปรับเปลี่ยนวิถีการกินที่เน้นสุขภาพให้มากขึ้น พร้อมออกกำลังกาย และงดทานของจุบจิบในยามท้องว่าง แล้วดื่มน้ำอย่างต่ำ 8 แก้วต่อวัน พร้อมกับพักผ่อนให้เพียงพอ และติดตามผล BMI ตลอดในช่วงควบคุมน้ำหนัก
 
ระดับ 30.0 > สภาวะ “อ้วนมาก”
 
บุคคลที่มีค่า BMI อยู่ในเกณฑ์ระดับสูงเกินตามมาตรฐานมาก มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้สูงที่สุด ควรทำการนัดพบแพทย์เพื่อรับยาในการควบคุมปริมาณน้ำตาลในเลือด พร้อมปรับเปลี่ยนพฤติกรรมการทานให้เป็นอาหารสุขภาพ งดทานอาหารที่เพิ่มมวลไขมันแก่ร่างกาย และหมั่นออกกำลังกายเป็นกิจวัตรประจำวันอย่างสม่ำเสมอ พักผ่อนให้เพียงพอ แล้วดื่มน้ำอย่างต่ำ 10-12 แก้วต่อวัน และติดตามผล BMI ตลอดในช่วงควบคุมน้ำหนัก""";
  static String noticeBody4 = """เนื่องจากการคำนวณดัชนีมวลกายเพื่อหาความสัมพันธ์เกี่ยวกับปริมาณไขมันในมวลร่างกายของผู้ใช้บริการนั้นมีข้อจำกัดทางด้านเพศ อายุ รวมถึงปริมาณกล้ามเนื้อของบุคคลบางกลุ่ม ที่ทำให้ผลการคำนวณค่า BMI มีผลที่แตกต่างออกไป ดังต่อไปนี้
 
การคำนวณ BMI ผู้หญิง มีแนวโน้มที่ปริมาณไขมันในร่างกายสูงกว่าผู้ชาย เนื่องจากฮอร์โมนเพศหญิงช่วยเร่งสารอาหารให้เป็นไขมันได้ง่ายกว่าผู้ชาย ซึ่งทำให้การคำนวณดัชนีมวลกายผู้ชายในการตรวจดูไขมัน พบแค่ 15% ในขณะผู้หญิงพบถึง 25% ของมวลไขมันทั้งหมด
ผู้ที่อายุมากกว่า มีโอกาสสูงที่ปริมาณไขมันสะสมมากกว่าผู้ที่อายุน้อยกว่า
นักกีฬาที่ได้รับการฝึกฝนร่างกายทางกายภาพสูง จะมีผลการคำนวณค่า BMI ที่มีมวลกล้ามเนื้อสูงกว่าปริมาณไขมันในองค์ประกอบร่างกายมากกว่าคนทั่วไป""";
  static String noticeBody5 = """โดยทั่วไป ความเสี่ยงของค่าเฉลี่ยจากการคำนวณค่า BMI ที่สูงเกินไป มีปัจจัยการเกิดปัญหาโรคอ้วนต่างๆ ดังต่อไปนี้
 
โรคความดันโลหิตสูง
โรคไขมันในเลือดสูง
โรคตับ นิ่วในถุงน้ำดี
โรคเบาหวาน
โรคหลอดเลือดสมอง
โรคนอนหลับแล้วหยุดหายใจ""";
  static String noticeBody6 = """1. การออกกำลังกาย

สูตรคํานวณ BMI

การออกกำลังกาย ช่วยพัฒนาศักยภาพทางด้านกายภาพของผู้ป่วยให้มีความแข็งแรงมากขึ้น เพิ่มภูมิต้านทาน ช่วยทำให้สภาพจิตใจเบิกบานแจ่มใส ลดความเครียด อีกทั้งระบบภายในร่างกายสามารถทำงานได้ดียิ่งขึ้น ช่วยชะลออายุอวัยวะภายในให้มีการใช้งานที่ยืนยาว และสร้างภูมิคุ้มกันให้ร่างกายป้องกันจากโรคแทรกซ้อนจากโรคอ้วนอีกด้วย

เมื่อผู้ป่วยออกกำลังกายเป็นกิจวัตรประจำวัน จะช่วยทำให้สรีระร่างกายที่เคยอ้วนท้วม กลับมามีรูปร่างที่สมส่วน กระชับ และเปลี่ยนปริมาณไขมันบางส่วนให้เป็นกล้ามเนื้อที่แข็งแรง การคำนวณค่า BMI ที่มีค่าเฉลี่ยตัวเลขสูงก็จะลดลงตามความถี่ของผู้ป่วย มีวินัยในการออกกำลังกายอย่างสม่ำเสมอ  
 
2. การเลือกรับประทานอาหารที่มีไขมันต่ำ

วิธีคํานวณ BMI

ในกรณีที่ผู้ป่วยมีเกณฑ์การคำนวณค่า BMI ที่อยู่สูงกว่าระดับมาตรฐาน การเลือกรับประทานอาหารที่มีไขมันต่ำแต่ให้พลังงานสูง จะช่วยทำให้อิ่มท้อง และได้รับสารอาหารที่มีประโยชน์ในการหล่อเลี้ยงไปตามส่วนต่าง ๆ ของอวัยวะภายในของร่างกาย และลดความเสี่ยงการเกิดโรคอ้วนอีกเช่นกัน

ยกตัวอย่างสารอาหารที่เป็นโปรตีนอย่าง เนื้อปลา อกไก่ และถั่วตระกูลอัลมอนต์ ที่ให้คุณค่าทางสารอาหารแก่ร่างกาย และควรหลีกเลี่ยงวัตถุดิบอย่าง น้ำมัน แป้ง ในการมาเป็นส่วนประกอบอาหารที่เพิ่มปริมาณไขมันในร่างกาย
 
3. พักผ่อนให้เพียงพอ

เครื่องคํานวณ BMI

การพักผ่อนให้เพียงพอ อย่างน้อยวันละ 8 ชั่วโมง เป็นอีกหนึ่งวิธีการที่ช่วยป้องกันการเกิดโรคอ้วนและโรคแทรกซ้อนต่าง ๆ ได้อย่างดี เนื่องจากช่วงเวลาพักผ่อน อวัยวะภายในจะทำการซ่อมแซมส่วนที่สึกหรอ ที่ได้รับภาระการทำกิจกรรมหนัก ๆ มาทั้งวัน ทำให้เป็นวิธีฟื้นฟูสภาพร่างกายให้กลับมาแข็งแรง และฟื้นฟูสภาพจิตใจของผู้ป่วยให้มีสุขภาพจิตที่แจ่มใส พร้อมใช้ชีวิตวันรุ่งขึ้นได้ต่อไป""";
}
